[
  {
    "title": "instalacion",
    "contenido":  "<h1>Instalación</h1>\n<h3>Nota de compatibilidad</h3>\n<p>Vue no es compatible con IE8 y versiones anteriores, ya que utiliza las características de\n    ECMAScript 5 que son incompatibles en IE8. Sin embargo, admite todos los navegadores compatibles\n    con ECMAScript 5.</p>\n\n<h3>Notas de lanzamiento</h3>\n<p>Última versión estable: 2.5.16</p>\n<p>Las notas de lanzamiento detalladas para cada versión están disponibles en GitHub.</p>\n\n<h2>Vue Devtools</h2>\n<p>Cuando use Vue, le recomendamos que también instale Vue Devtools en su navegador, lo que le permite inspeccionar y depurar sus aplicaciones de Vue de una manera más amigable.</p>\n\n<h2>Inclusión Directa con script</h2>\n<p>Simplemente descargue e incluya la etiqueta script con la ruta correcta. Vue será registrado como una variable global.</p>\n<p>No utilice la versión minificada (de producción) durante el desarrollo. Usted perderá todas las advertencias interesantes para los errores más comunes!</p>\n<p><b>Versión de Desarrollo</b> Mensajes de error completos y modo de depuración</p>\n<p><b>Versión de Producción</b> Sin mensajes de error, 30.90KB min+gzip</p>\n\n<h3>CDN</h3>\n<p>Es recomendable vincular a un número específico de versión que pueda actualizar manualmente:</p>\n<pre><code> <span >&lt;<span >script</span> <span >src</span>=<span >\"https://cdn.jsdelivr.net/npm/vue@2.6.14/dist/vue.js\"</span>&gt;</span><span >&lt;/<span >script</span>&gt;</span></code></pre>\n<p>Para producción, recomendamos vincular a un número de versión específico y compilar para evitar roturas inesperadas de versiones más nuevas:</p>\n<pre><code><span>&lt;<span>script</span> <span>src</span>=<span>\"https://cdn.jsdelivr.net/npm/vue@2.6.14\"</span>&gt;</span><span>&lt;/<span>script</span>&gt;</span></code></pre>\n<p>Si está utilizando módulos ES nativos, también hay una compilación compatible con módulos ES:</p>\n<pre><code><span>&lt;<span>script</span> <span>type</span>=<span>\"module\"</span>&gt;</span><span class=\"javascript\">\n  <span>import</span> Vue <span>from</span> <span>'https://cdn.jsdelivr.net/npm/vue@2.6.14/dist/vue.esm.browser.js'</span>\n</span><span>&lt;/<span>script</span>&gt;</span></code></pre>\n<p>Puede buscar el código fuente del paquete NPM en cdn.jsdelivr.net/npm/vue .</p>\n<p>Vue también está disponible en unpkg y cdnjs (cdnjs tarda algún tiempo en sincronizarse, por lo que es posible que la última versión aún no esté disponible).</p>\n<p>Asegúrese de leer sobre las diferentes versiones de Vue y use la versión de producción\nen su sitio publicado, reemplazando vue.jscon vue.min.js. Esta es una compilación más pequeña optimizada para la velocidad en lugar de la experiencia de desarrollo.</p>\n\n<h2>NPM</h2>\n<p>NPM es el método de instalación recomendado al crear aplicaciones a gran escala con Vue. Se combina muy bien con paquetes de módulos como Webpack o Browserify . Vue también proporciona herramientas complementarias para la creación de componentes de un solo archivo .</p>\n<pre><code><span># latest stable</span>\n$ npm install vue</code></pre>\n\n<h2>CLI</h2>\n<p>Vue proporciona una CLI oficial para implementar rápidamente aplicaciones ambiciosas de una sola página. Proporciona configuraciones de compilación con baterías para un flujo de trabajo frontend moderno. Solo se necesitan unos minutos para poner en funcionamiento las compilaciones listas para producción, recarga en caliente y almacenamiento de pelusa. Consulte los documentos de la CLI de Vue para obtener más detalles.</p>\n<p>La CLI asume un conocimiento previo de Node.js y las herramientas de compilación asociadas. Si es nuevo en Vue o en las herramientas de compilación de front-end, le recomendamos encarecidamente que lea la guía sin ninguna herramienta de compilación antes de usar la CLI.</p>"
  },
  {
    "title": "Introducción",
    "contenido":  "introduccion"
  },
  {
    "title": "La instancia Vue",
    "contenido":  ""
  },
  {
    "title": "Sintaxis de Template",
    "contenido":  ""
  },
  {
    "title": "Propiedades Computadas y Observadores",
    "contenido":  ""
  },
  {
    "title": "Enlace Clases y Estilos",
    "contenido":  ""
  },
  {
    "title": "Renderización Condicional",
    "contenido":  ""
  },
  {
    "title": "Renderizado de lista",
    "contenido":  ""
  },
  {
    "title": "Manejo de eventos",
    "contenido":  ""
  },
  {
    "title": "Binding en Formularios",
    "contenido":  ""
  },
  {
    "title": "Conceptos Básicos de Componentes",
    "contenido":  ""
  }
]